//LOAN01        JOB ,MSGLEVEL=(2,0)
//GO            EXEC PGM=LOAN,PARM=('HTML')
//STEPLIB       DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
//INFILE        DD DSN=&SYSUID..COBOL.LOANIN(LOAN01),DISP=SHR
//OUTFILE       DD DSN=&SYSUID..LOAN.OUT(LOAN),DISP=(OLD,CATLG)
