//COMP     JOB ,MSGLEVEL=(2,0)
//COBRUN   EXEC IGYWCL
//COBOL.SYSIN   DD DSN=&SYSUID..LOAN.CBL(LOAN),DISP=SHR
//LKED.SYSLMOD  DD DSN=&SYSUID..COBOL.LOAD(LOAN),DISP=SHR
